"use strict";

//~Напишіть код, який запитуватиме
//логін за допомогою prompt і логувати результат
//в консоль браузера
//Якщо відвідувач вводить "Адмін",
//то prompt запитує пароль.
//Якщо нічого не ввели або натиснута клавіша Esc
//Вивести стороку "Скасовано"
// Інакше вивести рядок "Я вас не знаю"
//Пароль перевіряти так:
//Якщо введено пароль "Я головний",
//то вивести рядок "Добрий день!"
//інакше виводити рядок "Невірний пароль!"

const login = prompt("Введіть логін");
console.log(login);
if (login === "Адмін") {
  const password = prompt("Введіть пароль");
  if (!password) {
    console.log("Скасовано");
  } else if (password === "Я головний") {
    console.log("Добрий день!");
  } else {
    console.log("Невірний пароль!");
  }
} else {
  console.log("Я вас не знаю");
}